       identification division.
       program-id. HelloWorld.
       author. "Appez".

       procedure division.
           display "Hello World".
           stop run.

